app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 19]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "yo"], ["body", "yyyyyyyyyyyyy"], ["post_id", 19], ["created_at", "2016-06-07 14:31:15.489083"], ["updated_at", "2016-06-07 14:31:15.489083"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)